{
    "2026-02-01": {
        "Rockslp": [
            {
                "balance": "Fixes daggers actually now the correct damage value."
            },
            {
                "bugfix": "Fixes some weapon bugs."
            },
            {
                "code_imp": "Cleans up the weapon code a bit."
            }
        ],
        "Somniworld": [
            {
                "balance": "Lowered the prices of all inquisition clothing in their HERMES reliquary.\\nqol : Lifeblood and Mana potions are now clearly called exactly that in the inquisitorial reliquary."
            }
        ],
        "realforest2001": [
            {
                "bugfix": "Fixed Silver not affecting vampires."
            },
            {
                "bugfix": "Fixed Xylix worshippers needing an amulet of Ravox to pray."
            },
            {
                "bugfix": "Fixed Repair Undead ignoring antimagic."
            },
            {
                "bugfix": "FIxed iconstate name for lord rapier sheathe icons."
            },
            {
                "bugfix": "Fixed Knave Bandit not spawning with Quiver."
            }
        ]
    },
    "2026-02-02": {
        "MrTCo1": [
            {
                "rscadd": "New Court Physician Drip"
            },
            {
                "rscadd": "New Court Physician Canesword"
            }
        ]
    },
    "2026-02-03": {
        "realforest2001": [
            {
                "qol": "Improved flight interactions. You cannot take off with a roof over your head."
            },
            {
                "qol": "Stopping-Flying whilst stood directly on a turf will now be instant."
            },
            {
                "sound": "Added a wingflap to taking off and landing."
            },
            {
                "rscadd": "add: Made the vampire progeny tip change depending on if you can or can't rise more."
            },
            {
                "rscadd": "Vampires can now tell the difference between Vampire Spawn, Vampires and Wretch Vampires on examine."
            },
            {
                "code_imp": "Fixed a variable typo for clan covens."
            },
            {
                "code_imp": "Removed a duplicate proc entry."
            },
            {
                "image": "Added Vampire Spawn icon."
            },
            {
                "bugfix": "Fixed Vampire Spawn not having their own icon as they expected."
            },
            {
                "bugfix": "Fixed being able to spawn as a vampire when playing churchling."
            }
        ],
        "snowyseshi": [
            {
                "rscadd": "hollow curse ritual checks if the target is dead, hollow ritual checks if target has lux"
            }
        ]
    },
    "2026-02-04": {
        "CheffieGithub": [
            {
                "refactor": "refactored click code to pass param lists directly, report any click issues"
            }
        ]
    },
    "2026-02-05": {
        "realforest2001": [
            {
                "bugfix": "Blowing a kiss no longer reveals sneaking people."
            }
        ],
        "PotatoTomahto": [
            {
                "refactor": "skill levels can now be decimals"
            }
        ]
    },
    "2026-02-06": {
        "Rockslp": [
            {
                "rscdel": "Removed Lakkari and Kaledon"
            },
            {
                "code_imp": "Changed some item descriptions to remove mentions of Lakkari and Kaledon"
            }
        ],
        "Skorvy": [
            {
                "rscadd": "hollow-kin to guard list"
            }
        ]
    },
    "2026-02-07": {
        "realforest2001": [
            {
                "rscadd": "Outsiders making a meister account no longer reveal their role to the steward."
            }
        ]
    },
    "2026-02-08": {
        "CheffieGithub": [
            {
                "bugfix": "Dodge no longer always succeeds if show_rolls is disabled"
            }
        ]
    }
}